{
  "WorkshopId": 2926820352,
  "Title": "Jademouth",
  "Description": "[i]\r\"Hmm?\"\r\n\r\n\"...New to me.\"\r\n\r\n\"Jade.\" Uri turned the dull chip of green silicate in his hand. It caught the light, and held it in its grooves.\r\n\r\n\"Where's that from?\" asked the boy.\r\n\r\n\"Jademouth, mountain town. Only place in Qud that's found any. They export it.\"\r\n\r\n\"Mountain town?\"\r\n\r\n\"They've dug it into the side of the hill. Most of it's underground.\"\r\n\r\n\"Huh.\"\r\n\r\nThe jeweler tossed his jade back into its box. \"Check between the rivers next time you're near Omonporch. Have some gravy while you're there.\"[/i]\r\n\r\n[hr][/hr]\r\n\r\nIntroduces the mining town of Jademouth, hewn into a mountain between the River Svy and the River Opal. Seamlessly integrated into the base game, Jademouth features four written NPCs, as well as a population of prospectors and a functioning side quest with a unique reward.\r\n\r\n[b]Feature list:[/b]\r\n[list]\r\n[*]Introduces a fully mapped settlement called Jademouth, spread out across three screens, including its own recoiler and world faction. You can find it nestled in the northern hills\r\n[*]Adds the jade gemstone, rarely found in the world but mostly found inside Jademouth\r\n[*]Adds a new sidequest, Chaos Theory\r\n[*]Adds a new cooking recipe, Jademouth Gravy\r\n[*]Adds gem prospectors that sell jade, found throughout Jademouth but also appearing as Mechanimist converts, Freehold residents, etc.\r\n[/list]\r\n\r\nYou can find this mod's source code on [url=https://github.com/Ilysen/Jademouth]GitHub[/url], under the GPL v3 license. If you run into any issues, you can report them here or in the comments.\r I've endeavored to make the mod as stable as possible, but I always have my ears open for issues.\n\r\nThis mod is mostly made by me, but CoiledLamb (or just Lamb) from the Caves of Qud Discord has taken a lot of time out of their day to make sprites for the prospector and other NPCs, and as someone with no artistic ability, having proper sprites has contributed a lot to the town's feel. Thank you so much!\r\n\r\n[b]Known issues:[/b]\r\n[olist]\r\n[*]Some of the random creatures that can spawn in the vicinity of the town, like salamanders and dogs, might get into fights with the NPCs on sight. They always lose, but it's still noteworthy. It rarely causes any real damage, but you can run a rebuild if it messes up the map!\r\n[*]Jade glittermensches seem to show up with white as a detail color, instead of green.\n[/olist]",
  "Tags": "Stable,Beta,Quest,Settlement",
  "Visibility": "2",
  "ImagePath": "preview.png"
}